import { Grade } from "../../fsrs";
import { Knowledge, LearningAction } from "../types";

export const mockKnowledges: Knowledge[] = [
  {
    name: "Карточка 1",
    question: "Какой самый большой океан на Земле?",
    answer: "Самый большой океан на Земле — это Тихий океан. Он занимает площадь около 63 миллионов квадратных миль (165 миллионов квадратных километров) и простирается между Азией и Австралией на западе и Северной и Южной Америкой на востоке.",
    id: "887a7f64-94a3-4791-baf4-621467d2340c"
  },
  {
    name: "Карточка 2",
    question: "Какой континент считается родиной пингвинов?",
    answer: "Родиной пингвинов является Антарктида. Эти птицы прекрасно адаптированы к холодным условиям и могут быть найдены на этом континенте, а также на некоторых близлежащих островах.",
    id: "1f290870-031a-41d7-af44-4b9b1f5bc863"
  },
  {
    name: "Карточка 3",
    question: "Что такое \"Солнечная система\"?",
    answer: "Солнечная система — это группа небесных тел, которые вращаются вокруг Солнца. Она включает в себя восемь планет, их луны, карликовые планеты, астероиды и кометы. Основные планеты, начиная от Солнца, это Меркурий, Венера, Земля, Марс, Юпитер, Сатурн, Уран и Нептун.",
    id: "82fd6962-dd35-4d5e-bb5f-7dc1fbd6cbda"
  }
];